var variants = {
  what: ['API для чистки зубов', 'Пивной ларек', 'Wysiwyg редактор', 'Офисный пакет', 'Скриншотер', 'Клон Dota', 'Шутер', 'Виртуальная машина', 'Стратегия', 'RPG', 'Песочница', 'Приложение вконтакте', 'Приложение facebook', 'Эмулятор Windows', 'IDE', 'Клон Skype', 'Анонимный чат', 'Блогохостинг', 'Видео-хостинг', 'Видео-чат', 'Генератор идей', 'Движок для форумов', 'Доска объявлений', 'Коллективный блог', 'Музыкальный сервис', 'Новостной портал', 'Облачный хостинг', 'Онлайн-библиотека', 'Операционная система', 'Поисковая система', 'Почтовый сервис', 'Процессинг карт', 'Сервис микроблоггинга', 'Торрент-трекер', 'Файлообменник', 'Фотохостинг', 'Хостинг', 'Чат', 'CMS', 'Дистрибутив линукса', 'Социальная сеть', 'Цитатник', 'Веб-браузер', 'Каталог jQuery-плагинов', 'Вики', 'Сервис координации флешмобов', 'MMORPG', 'Фоторедактор', 'Онлайн-рисовалка', 'Хостинг исходников', 'Сайт о путешествиях', 'Кулинарный сайт', 'Погода', 'Будильник', 'RSS-ридер', 'Калькулятор', 'Сайт знакомств для животных', 'Онлайн-университет', 'Блокировщик рекламы', 'Сайт с видео-уроками по вышиванию', 'Закрытое сообщество', 'Сервис поиска собутыльников', 'Система проверки на плагиат', 'Сокращатель ссылок', 'Сервис подбора музыки', 'Сервис подбора платьев', 'Сервис подбора причесок', 'Сервис подбора хостинга', 'Сервис подбора CMS', 'Сервис подбора ресторанов', 'Онлайн-аукцион', 'Магазин футболок', 'Магазин носков', 'Сервис мгновенных сообщений', 'Сервис голосовых сообщений', 'Планировщик', 'Календарь', 'Навигатор', 'Эмулятор старых консолей', 'Судоку', 'IQ-тест', 'Сервис микроплатежей', 'Аггрегатор новостей', 'Сервис облачных бекапов', 'CDN', 'Сервис ВиО', 'Табличный процессор', 'Кнопки соцсетей', 'Система комментариев на сайт', 'Поиск для сайта', 'Онлайн-кинотеатр', 'Система статистики', 'Хостинг портфолио', 'Онлайн музыкальный редактор', 'Музыкальный плеер', 'Видео плеер', 'Онлайн-радио', 'Сайт знакомств', 'Сервис сайтов-визиток', 'Карты', 'Защищенный мессенджер', 'Анонимайзер', 'Записная книга', 'Сервис быстрых заметок', 'Дашбоард для умного дома', 'Панель управления', 'Магазин PSD', 'Сервис социальных коллекторских услуг', 'Клон хабра', 'Клон вконтакте', 'Клон фейсбука', 'Деанонимайзер', 'To-Do лист', 'Клон 2048', 'Клон Flappy Bird', 'Фитнес-браслет', 'Reddit', 'Бенчмарк', 'Антивирус', 'Криптовалюта', 'Диктофон', 'Телефон', 'Асоциальная сеть', 'Очередной блог', 'Текстовый редактор', 'Фонарик', 'Файловый менеджер', 'CRM', 'Стриминговый сервис', 'Twitch.tv', 'Plug.dj', 'Google Docs', 'Pinterest', 'JS-фреймворк', 'GitHub', 'Текстовый редактор', 'Переводчик', 'Imgur', 'Облако', 'Банк'],
  with: ['с геолокацией', 'с интергацией с твиттером', 'с интеграцией с социальными сетями', 'с оплатой биткоинами', 'с блекджеком и шлюхами', 'с преферансом и дамами', 'с поддержкой markdown', 'с классной анимацией', 'без регистрации и смс в хорошем качестве', 'с rss-фидом', 'с приложениями для мобильных платформ', 'с монетизацией трафика', 'с микроплатежами', 'под андроид', 'с DLC', 'с возможностью комментирования', 'с подстройкой под себя', 'с двухфакторной авторизацией', 'с лайками и дизлайками', 'с промокодами', 'с автоматической генерацией "короткой" ссылки', 'в стиле веб 2.0', 'в минималистичном стиле', 'с кучей рекламы', 'на twitter bootstrap', 'с бэкендом на Parse', 'с бэкендом на Node.js', 'на Node.js', 'на Sinatra', 'на Django', 'на Rails', 'живущий на донат', 'для Linux', 'для пожилых людей', 'для хипстеров', 'под мобильные платформы', 'для любителей аниме', 'с большим выбором матерных частушек', 'для телефонов с J2ME', 'для людей с ограниченными возможностями', 'с высоким уровнем анонимности', 'для молодёжи', 'с геотаргетингом', 'с кнопкой "Мне повезёт!"', 'с возможностью тонкой настройки', 'без рекламы', 'с кучей тем оформления', 'с нескучными обоями', 'с кнопкой "Share"', 'без лишних наворотов', 'с запоминающимся названием', 'с премиум-аккаунтами', 'с оплатой по подписке', 'за 1 доллар в месяц', 'за 1 доллар в год', 'для программистов', 'для социопатов', 'для фанаток Джастина Бибера', 'для тех, кому не всё равно', 'для самых маленьких', 'для владельцев жигулей', 'с голосовым управлением', 'из Китая', 'с доставкой Почтой России', 'с бесплатной доставкой', 'с платными DLC', 'с микротранзакциями', 'под iOS', 'для Windows', 'работающий на дровах', 'для подписчиков MDK', 'на Flask', 'на Flash', 'под Windows 95', 'из Arduino', 'с различными цветовыми схемами', 'с кучей кнопочек', 'и чтоб не тормозил', 'красного цвета', 'на Wordpress', 'на Drupal', 'без херни', 'который купит Google и закроет', 'который взорвёт мир', 'в PDF', 'для Windows Phone', 'для некстген-консолей', 'для телезрителей', 'для азиатского рынка', 'который изменит мир']
};

// А ты как себе это представлял?

$(document).ready(function(){
  var generate = function(){
    generateOne();
    generateTwo();
  }

  var generateOne = function(){
    hideHello();
    $("#part-one").fadeOut(150, function(){
      $(this).text(variants.what[Math.floor(Math.random()*variants.what.length)]);
      social();
      $(this).fadeIn(250);
    });
    hideHello();
  }

  var generateTwo = function(){
    hideHello();
    $("#part-two").fadeOut(150, function(){
      $(this).text(variants.with[Math.floor(Math.random()*variants.with.length)]);
      social();
      $(this).fadeIn(250);
    });
  }

  var hideHello = function(){
    $("#hello").fadeOut(150);
  }

  var social = function(){
    var rand = Math.floor(Math.random()*10000000);
    var text = "Моя идея для стартапа: " + $("#part-one").text() + " " + $("#part-two").text() + ".";
    $("#tweet").attr("href", "https://twitter.com/home?status=" + text + " Получи свою на http://git.io/vqU3L");
    $("#vkshare").attr("href", "https://vk.com/share.php?url=http://4ndv.github.io/startupideas/?" + rand + "&title=Генератор идей стартапов. " + text + " Получи свою здесь!" + "&description=Генератор идей стартапов v3.0")
  }

  $("#generate").click(generate);
  $("#part-one").click(generateOne);
  $("#part-two").click(generateTwo);
});
